{"id":"387b24db-defc-4802-91b1-2db123f56b46","name":"St Clement Danes School","code":"3D3","type":"lead_school","isAccreditedBody":false,"urn":"136901","ukprn":"10058906","address":{"addressLine1":"St Clement Danes School","addressLine2":"Chenies Road","town":"Chorleywood","county":"Hertfordshire","postcode":"WD3 6EW"},"contact":{"website":"http://www.stclementdanes.herts.sch.uk/","email":"traintoteach@danesedtrust.org.uk","telephone":"01923 284169","fullName":"Louisa"},"location":{"latitude":51.6637779,"longitude":-0.5140812},"trainWithUs":"Led by Louisa Leonard at St Clement Danes School and Chris Powell at Chancellor’s School for Danes Educational Trust, we provide exceptional teacher training for graduates and career changers who have chosen to become teachers. In partnership with the University of Hertfordshire, we offer the School Direct, School Direct Salaried and Assessment Only routes into teaching. Mentor allocation and training is robust, drawing upon the expertise of the University of Hertfordshire and colleagues from across Danes Educational Trust: The Partnership. Colleagues at our training schools share their knowledge and good practice to ensure that trainees are well supported to develop into aspiring teachers and future leaders. We endeavour to make training exceptional and celebrate the enthusiastic contribution that trainee teachers make to our school communities. The programmes are carefully structured to allow trainees to develop the skills required to teach the subject that they are training in and to develop specific expertise for making a distinctive contribution to practice in their setting. Working in partnership with a varied set of schools across our Partnership nexus means that we offer a carefully designed programme which integrates trainees and Early Career Teachers into contrasting school settings where they can develop the ability to teach and learn collaboratively.","trainWithDisability":"In keeping with our core values, Danes Educational Trust schools find joy in working, teaching and learning together. We value and support the wellbeing of all individuals who train, work and learn in our schools. As such, we provide equality of opportunity and experience for all within a safe and secure learning environment. We work hard to provide tailored support to meet individual needs which equip our trainees with the skills and support needed to succeed in their training. We understand that disclosing a disability can be difficult. We work in partnership with the university and specialists within the Trust to support individuals with a variety of needs. Information is treated as confidential and only shared with those required to make necessary arrangements. Working directly with the university, we support our trainees to access the expertise of disability advisers, specialist mentoring as well as services pertaining to diagnostic and needs assessments.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-29T23:14:37.318Z","updatedAt":"2021-10-12T23:06:14.049Z"}