{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","name":"University of Hertfordshire","code":"H36","type":"hei","isAccreditedBody":true,"urn":"133783","ukprn":"10007147","address":{"addressLine1":"University of Hertfordshire","town":"Hatfield","county":"Hertfordshire","postcode":"AL10 9AB"},"contact":{"website":"https://go.herts.ac.uk/teachertraining","email":"admcom@herts.ac.uk","telephone":"01707 284800","fullName":"School of Education"},"location":{"latitude":51.7518204,"longitude":-0.2387957},"trainWithUs":"The University of Hertfordshire is a leading regional provider of [Initial Teacher Education](https://www.herts.ac.uk/study/schools-of-study/education/initial-teacher-education). Consistently high achieving in its Ofsted inspections and in the Guardian and Times League tables, it is rightly proud of its excellent reputation with local and regional schools who often employ our student teachers.\nThe School of Education has an excellent record of employment for trainees on their Initial Teacher Education programmes, and those who actively seek a teaching post at the end of their programme are successful in joining the profession.\nAfter completing Initial Teacher Education there are opportunities to continue your studies with the University through the [MA Education Framework](https://www.herts.ac.uk/study/schools-of-study/education/postgraduate-courses-education/ma-education-framework).","trainWithDisability":"The University of Hertfordshire is committed to promoting equality of opportunity to ensure that it meets the needs of disabled people and has policies that are intended to support all students both in their studies and in developing their professional practice.\nIf you have a disability or other need we encourage you to disclose this and any other relevant information that could support your studies.\nThe School of Education at the University of Hertfordshire provides both academic and practice placement support for teachers in training with disabilities and other needs.\nOne key aspect of the PGCE course is to raise awareness of mental health and well-being and to support the removal of unnecessary workload. [University of Hertfordshire disability support](https://www.herts.ac.uk/life/student-support/disability-services)\n[University of Hertfordshire statement on disability disclosure by students](https://www.herts.ac.uk/life/student-support/disability-services/statement-on-disability-disclosure-by-students)","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:50:56.422Z","updatedAt":"2021-09-29T14:53:45.803Z"}